cf/Documents/_DemoGoodsReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>_DemoGoodsReceipt</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._DemoGoodsBalancesInStorageLocations</xr:Item>
				<xr:Item>AccountingRegister._DemoAccountingTransactionLog</xr:Item>
				<xr:Item>AccountingRegister._DemoAccountingEntriesJournalWithoutCorrespondence</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Partner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoPartners</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCounterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCounterpartiesContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StorageLocation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoStorageLocations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoVATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeResponsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxInvoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._DemoTaxInvoiceReceived</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConsiderVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingDocumentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Goods</Name>
					<Comment>Goods</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Products</Name>
							<Comment>Products</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef._DemoProducts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Comment>Count</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CCDNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AgentServices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Products</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._DemoProducts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Counterparty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._DemoCounterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EventDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/_DemoGoodsBalancesInStorageLocations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>_DemoGoodsBalancesInStorageLocations</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoProducts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StorageLocation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoStorageLocations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccountingRegisters/_DemoAccountingTransactionLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccountingRegister>
		<Properties>
			<Name>_DemoAccountingTransactionLog</Name>
			<ChartOfAccounts>ChartOfAccounts._DemoMain</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts._DemoMain.AccountingFlag.Currency1</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MonetaryAmountPositiveNegative</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrencyAmount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MonetaryAmountPositiveNegative</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentLanguage1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentLanguage2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/AccountingRegisters/_DemoAccountingEntriesJournalWithoutCorrespondence.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccountingRegister>
		<Properties>
			<Name>_DemoAccountingEntriesJournalWithoutCorrespondence</Name>
			<ChartOfAccounts>ChartOfAccounts._DemoMain</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts._DemoMain.AccountingFlag.Currency1</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MonetaryAmountPositiveNegative</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrencyAmount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MonetaryAmountPositiveNegative</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentLanguage1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentLanguage2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/Documents/_DemoGoodsReceipt/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then // Create a new item.
		_DemoStandardSubsystems.OnEnterNewItemFillCompany(ThisObject);
	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	TaxInvoice = Undefined;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	GenerateRegisterRecordsByStorageLocations();
	
	GenerateAccountingRegisteredRecords();
	
EndProcedure

#EndRegion

#Region Private

Procedure GenerateRegisterRecordsByStorageLocations()
	
	RegisterRecords._DemoGoodsBalancesInStorageLocations.Write = True;
	
	For Each LineProducts_ In Goods Do
		
		Movement = RegisterRecords._DemoGoodsBalancesInStorageLocations.Add();
		
		Movement.Period        = Date;
		Movement.RecordType   = AccumulationRecordType.Receipt;
		
		Movement.Organization   = Organization;
		Movement.StorageLocation = StorageLocation;
		
		Movement.Products  = LineProducts_.Products;
		Movement.Count    = LineProducts_.Count;
		
	EndDo;
	
EndProcedure

Procedure GenerateAccountingRegisteredRecords()
	
	ForeignExchangeDocument = Common.ObjectAttributeValue(Currency, "Code") <> "643";
	If Currency.IsEmpty() Then
		DocumentCurrency  = New Structure("Rate, Repetition", 1, 1,);
	Else
		DocumentCurrency  = CurrencyRateOperations.GetCurrencyRate(Currency, Date);
	EndIf;
	
	ProcessVAT = ConsiderVAT And Not ForeignExchangeDocument;
	
	RegisterRecords._DemoAccountingTransactionLog.Write = True;
	RegisterRecords._DemoAccountingEntriesJournalWithoutCorrespondence.Write = True;
	
	For Each RowOfProduct In Goods Do
		
		GenerateMovementOfReceiptOfGoodsByRegisterOfMain(RowOfProduct, ForeignExchangeDocument, DocumentCurrency);   
		ToFormMovementOfReceiptOfGoodsByRegisterOfMainWithoutCorrespondence(RowOfProduct, ForeignExchangeDocument, DocumentCurrency);
		
		If ProcessVAT Then
			GenerateMovementOfIncomingVATAccountingAccordingToBasicRegister(RowOfProduct); 
			GenerateMovementOfIncomingVATAccordingToBasicRegisterWithoutCorrespondence(RowOfProduct);
		EndIf;
		
	EndDo;
	
EndProcedure

Procedure GenerateMovementOfReceiptOfGoodsByRegisterOfMain(Val RowOfProduct, Val CurrencyAccounting, Val DocumentCurrency)
	
	CurrencyAmount = RowOfProduct.Price * RowOfProduct.Count;
	RubleAmount = CurrencyAmount * DocumentCurrency.Rate / DocumentCurrency.Repetition;
	
	Movement = RegisterRecords._DemoAccountingTransactionLog.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = RubleAmount;
	
	Movement.AccountDr = ChartsOfAccounts._DemoMain.ProductStock;
	
	Movement.ExtDimensionsDr.Counterparties  = Counterparty;
	Movement.ExtDimensionsDr.Products = RowOfProduct.Products;
	Movement.ExtDimensionsDr.Warehouses       = StorageLocation;
	
	Movement.CountDr = RowOfProduct.Count;
	
	If CurrencyAccounting Then
		Movement.AccountCr          = ChartsOfAccounts._DemoMain.SettlementsWithSuppliersCurr;
		Movement.CurrencyCr        = Currency;
		Movement.CurrencyAmountCr = CurrencyAmount;
	Else
		Movement.AccountCr = ChartsOfAccounts._DemoMain.VendorsARAPAccounting;
	EndIf;
	
	Movement.ExtDimensionsCr.Counterparties = Counterparty;
	Movement.ExtDimensionsCr.Contracts    = Contract;
	
	Movement.CountCr = RowOfProduct.Count;
	
EndProcedure

Procedure GenerateMovementOfIncomingVATAccountingAccordingToBasicRegister(Val RowOfProduct)
	
	RubleAmount = RowOfProduct.Price * RowOfProduct.Count;
	VATAmount = RubleAmount / 100 * Common.ObjectAttributeValue(VATRate, "Rate1");
	
	Movement = RegisterRecords._DemoAccountingTransactionLog.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = VATAmount;
	
	Movement.AccountDr = ChartsOfAccounts._DemoMain.VATOnPurchasedInventory;
	Movement.ExtDimensionsDr.Counterparties = Counterparty;
	
	Movement.AccountCr = ChartsOfAccounts._DemoMain.VendorsARAPAccounting;
	Movement.ExtDimensionsCr.Counterparties = Counterparty;
	Movement.ExtDimensionsCr.Contracts    = Contract;
	
EndProcedure

Procedure ToFormMovementOfReceiptOfGoodsByRegisterOfMainWithoutCorrespondence(Val RowOfProduct, Val CurrencyAccounting, Val DocumentCurrency)
	
	CurrencyAmount = RowOfProduct.Price * RowOfProduct.Count;
	RubleAmount = CurrencyAmount * DocumentCurrency.Rate / DocumentCurrency.Repetition;
	
	Movement = RegisterRecords._DemoAccountingEntriesJournalWithoutCorrespondence.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = RubleAmount;	
	Movement.Account = ChartsOfAccounts._DemoMain.ProductStock;	
	Movement.ExtDimensions.Counterparties  = Counterparty;
	Movement.ExtDimensions.Products = RowOfProduct.Products;
	Movement.ExtDimensions.Warehouses       = StorageLocation;	
	Movement.Count = RowOfProduct.Count;
		
	Movement = RegisterRecords._DemoAccountingEntriesJournalWithoutCorrespondence.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = RubleAmount;	
	
	If CurrencyAccounting Then
		Movement.Account          = ChartsOfAccounts._DemoMain.SettlementsWithSuppliersCurr;
		Movement.Currency        = Currency;
		Movement.CurrencyAmount = CurrencyAmount;
	Else
		Movement.Account = ChartsOfAccounts._DemoMain.VendorsARAPAccounting;
	EndIf;
	
	Movement.ExtDimensions.Counterparties = Counterparty;
	Movement.ExtDimensions.Contracts    = Contract;
	
	Movement.Count = RowOfProduct.Count; 
		
EndProcedure

Procedure GenerateMovementOfIncomingVATAccordingToBasicRegisterWithoutCorrespondence(Val RowOfProduct)
	
	RubleAmount = RowOfProduct.Price * RowOfProduct.Count;
	VATAmount = RubleAmount / 100 * Common.ObjectAttributeValue(VATRate, "Rate1");
	
	Movement = RegisterRecords._DemoAccountingEntriesJournalWithoutCorrespondence.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = VATAmount;
	Movement.Account = ChartsOfAccounts._DemoMain.VATOnPurchasedInventory;
	Movement.ExtDimensions.Counterparties = Counterparty;      
	
	Movement = RegisterRecords._DemoAccountingEntriesJournalWithoutCorrespondence.Add();
	Movement.Period      = Date;
	Movement.Organization = Organization;
	Movement.Content  = NStr("ru = 'Поступление товаров';
								|en = 'Receipt of goods';");
	Movement.Sum       = VATAmount;	
	Movement.Account = ChartsOfAccounts._DemoMain.VendorsARAPAccounting;
	Movement.ExtDimensions.Counterparties = Counterparty;
	Movement.ExtDimensions.Contracts    = Contract;
	
EndProcedure

#EndRegion

#Else
Raise NStr("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.';");
#EndIf
